In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame()

In [3]:
df

Empty DataFrame
Columns: []
Index: []

In [4]:
print(df)

Empty DataFrame
Columns: []
Index: []

In [5]:
df1 = pd.DataFrame([[23,32,65,87,2],[53,62,63,27,2],[63,33,65,47,62],[33,52,55,77,34],[27,72,37,34,20]])

In [6]:
df1

    0   1   2   3   4
0  23  32  65  87   2
1  53  62  63  27   2
2  63  33  65  47  62
3  33  52  55  77  34
4  27  72  37  34  20

In [7]:
df1.head(3)

    0   1   2   3   4
0  23  32  65  87   2
1  53  62  63  27   2
2  63  33  65  47  62

In [8]:
df1.tail()

    0   1   2   3   4
0  23  32  65  87   2
1  53  62  63  27   2
2  63  33  65  47  62
3  33  52  55  77  34
4  27  72  37  34  20

In [9]:
df1.tail(2)

    0   1   2   3   4
3  33  52  55  77  34
4  27  72  37  34  20

In [10]:
df1.shape

(5, 5)

In [11]:
df1.iloc[0:2,1:3]

    1   2
0  32  65
1  62  63